Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.Completeness Constructor
 Initializes a new instance of the Completeness class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Completeness()
Public Sub New
See Also
Reference
TaskFilterExpressions.Completeness Class
Tekla.Structures.Filtering.Categories Namespace